CSI API ETABS v1

# cPointElm Interface

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    public interface cPointElm

    Public Interface cPointElm

    Dim instance As cPointElm

    public interface class cPointElm

    type cPointElm =  interface end

The cPointElm type exposes the following members.

Methods

| Name| Description
---|---|---
| [Count](c28142af-
bfa2-1f33-9947-982b82f6ef42.htm)|
|
CountConstraint|
|
CountLoadDispl|
|
CountLoadForce|
|
CountRestraint|
|
CountSpring|
|
GetConnectivity|
|
GetConstraint|
| [GetCoordCartesian](3cc45751-71ab-
ea0c-798e-24aaf225c3f7.htm)|
|
GetLoadDispl|
|
GetLoadForce|
|
GetLocalAxes|
|
GetNameList|
|
GetObj|
|
GetPatternValue|
|
GetRestraint|
|
GetSpring|
|
GetSpringCoupled|
|
GetTransformationMatrix|
|
IsSpringCoupled|
Top

See Also

#### Reference

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com